---
kind: property
id: P:Autodesk.Revit.DB.FolderItemInfo.ElementId
source: html/7f892bab-a50d-f9ce-f7a4-6b1f43e6c31c.htm
---
# Autodesk.Revit.DB.FolderItemInfo.ElementId Property

The folder parameter Id

## Syntax (C#)
```csharp
public ElementId ElementId { get; }
```